erp3l/src/Catalogs/СП_СхемыДанных/СП_СхемыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СП_СхемыДанных</name>
  <attributes>
    <name>ТекстСхемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСхемы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсключаемыеРеквизиты</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/СП_СхемыДанных/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ИмяОбъекта = ОбъектКопирования.ИмяОбъекта;
	ВерсияСхемы = 0;
	ИсключаемыеРеквизиты = Новый ХранилищеЗначения(Неопределено);
	ТекстСхемы = "";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
